app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]
---
<h2> Все Коментарии</h2>
<% @post.comments.each do |comment| %>