app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "номер1s"], ["updated_at", "2020-11-30 18:50:37.156120"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])

        if(@post.update(post_params))

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "new state1"], ["body", "11111111111111111111111111111"], ["created_at", "2020-11-30 19:17:15.519882"], ["updated_at", "2020-11-30 19:17:15.519882"]]
---
    def create

        @post = Post.new(post_params)

        if (@post.save)